using System;
using ShellFiler.Api;
using ShellFiler.FileViewer;

namespace ShellFiler.Command {
    
    //=========================================================================================
    // クラス：キー、ツールバーなどのイベントを受けて実行するコマンド
    // 　　　　ツールバーなどの共通化のために使用するインターフェースで、ファイル一覧用、
    // 　　　　ファイルビューア用、グラフィックビューア用として実装する
    //=========================================================================================
    public interface ActionCommand {

        //=========================================================================================
        // 機　能：機能を実行する
        // 引　数：[in]param パラメータ
        // 戻り値：実行結果
        //=========================================================================================
        object Execute();

        //=========================================================================================
        // 機　能：パラメータをセットする
        // 引　数：[in]param  セットするパラメータ
        // 戻り値：なし
        //=========================================================================================
        void SetParameter(params object[] param);

        //=========================================================================================
        // プロパティ：コマンドのUI表現
        //=========================================================================================
        UIResource UIResource {
            get;
        }
    }
}
