using System;
using System.Collections.Generic;
using System.IO;
using System.Text;

namespace ShellFiler.FileTask.DataObject {

    //=========================================================================================
    // クラス：ディスクのボリューム情報
    //=========================================================================================
    public class VolumeInfo : ICloneable {
        // ボリュームラベル
        private string m_volumeLabel;
        
        // 使用サイズ（不明なときは-1）
        private long m_usedDiskSize;
        
        // 空きサイズ（不明なときは-1）
        private long m_freeSize;

        // 空き割合（不明なときは-1）
        private int m_freeRatio;

        // クラスタサイズ
        private long m_clusterSize;

        // ドライブ情報の文字列
        private string m_driveEtcInfo;
        
        // Cloneをサポート

        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：なし
        // 戻り値：なし
        //=========================================================================================
        public VolumeInfo() {
        }

        //=========================================================================================
        // 機　能：クローンを作成する
        // 引　数：なし
        // 戻り値：作成したクローン
        //=========================================================================================
        public object Clone() {
            return MemberwiseClone();
        }

        //=========================================================================================
        // プロパティ：ボリュームラベル
        //=========================================================================================
        public string VolumeLabel {
            get {
                return m_volumeLabel;
            }
            set {
                m_volumeLabel = value;
            }
        }

        //=========================================================================================
        // プロパティ：使用サイズ（不明なときは-1）
        //=========================================================================================
        public long UsedDiskSize {
            get {
                return m_usedDiskSize;
            }
            set {
                m_usedDiskSize = value;
            }
        }

        //=========================================================================================
        // プロパティ：空きサイズ（不明なときは-1）
        //=========================================================================================
        public long FreeSize {
            get {
                return m_freeSize;
            }
            set {
                m_freeSize = value;
            }
        }

        //=========================================================================================
        // プロパティ：空き割合[%]（不明なときは-1）
        //=========================================================================================
        public int FreeRatio {
            get {
                return m_freeRatio;
            }
            set {
                m_freeRatio = value;
            }
        }

        //=========================================================================================
        // プロパティ：クラスタサイズ（不明なときは1）
        //=========================================================================================
        public long ClusterSize {
            get {
                return m_clusterSize;
            }
            set {
                m_clusterSize = value;
            }
        }

        //=========================================================================================
        // プロパティ：ドライブ情報の文字列
        //=========================================================================================
        public string DriveEtcInfo {
            get {
                return m_driveEtcInfo;
            }
            set {
                m_driveEtcInfo = value;
            }
        }
    }
}
