using System;
using System.Collections.Generic;
using System.Text;
using ShellFiler.Api;
using ShellFiler.Properties;
using ShellFiler.FileSystem;
using ShellFiler.FileTask.Provider;
using ShellFiler.FileTask.Management;
using ShellFiler.Util;
using ShellFiler.UI;
using ShellFiler.UI.Log;

namespace ShellFiler.FileTask {

    //=========================================================================================
    // クラス：ファイル操作のバックグラウンドタスクとなる基底クラス
    //=========================================================================================
    public interface IBackgroundTask {

        //=========================================================================================
        // 機　能：タスクを開始する
        // 引　数：[in]suspend  Suspend状態で起動するときtrue
        // 戻り値：なし
        //=========================================================================================
        void StartTask(bool suspend);

        //=========================================================================================
        // 機　能：処理を中断または再開する
        // 引　数：[in]suspend  Suspend状態にするときtrue
        // 戻り値：なし
        //=========================================================================================
        void SetSuspendState(bool suspend);

        //=========================================================================================
        // 機　能：ファイル転送のタスクをキャンセルする
        // 引　数：[in]reason  キャンセルした理由
        // 戻り値：なし
        //=========================================================================================
        void SetCancel(CancelReason reason);

        //=========================================================================================
        // 機　能：スレッドの終了まで待機する
        // 引　数：なし
        // 戻り値：なし
        //=========================================================================================
        void JoinThread();

        //=========================================================================================
        // プロパティ：転送元/転送先の情報
        //=========================================================================================
        BackgroundTaskPathInfo PathInfo {
            get;
        }

        //=========================================================================================
        // プロパティ：タスクID
        //=========================================================================================
        BackgroundTaskID TaskId {
            get;
        }

        //=========================================================================================
        // プロパティ：処理を中止するときtrue
        //=========================================================================================
        bool IsCancel {
            get;
        }

        //=========================================================================================
        // プロパティ：バックグラウンドタスクの種類
        //=========================================================================================
        BackgroundTaskType BackgroundTaskType {
            get;
        }
    }
}
