using System;
using System.Collections.Generic;
using System.IO;
using System.Text;
using System.Threading;
using ShellFiler.Api;
using ShellFiler.FileSystem;
using ShellFiler.Properties;
using ShellFiler.FileViewer;
using ShellFiler.Locale;
using ShellFiler.Util;

namespace ShellFiler.FileTask.Condition {

    //=========================================================================================
    // クラス：ファイル転送条件の共通クラス（Windows用/SSH用/定義済みの基底クラス）
    //=========================================================================================
    public abstract class FileConditionItem {

        //=========================================================================================
        // 機　能：設定をリセットする
        // 引　数：なし
        // 戻り値：なし
        //=========================================================================================
        public abstract void ResetCondition();

        //=========================================================================================
        // 機　能：クローンを作成する
        // 引　数：なし
        // 戻り値：作成したクローン
        //=========================================================================================
        public abstract object Clone();

        //=========================================================================================
        // 機　能：設定値が同じかどうかを返す
        // 引　数：[in]other  比較対象
        // 戻り値：設定値が同じときtrue
        //=========================================================================================
        public abstract bool EqualsConfigObject(FileConditionItem other);

        //=========================================================================================
        // 機　能：設定が空の状態かどうかを調べる
        // 引　数：なし
        // 戻り値：設定が空の状態のときtrue
        //=========================================================================================
        public abstract bool IsEmptyCondition();

        //=========================================================================================
        // 機　能：表示文字列を返す
        // 引　数：なし
        // 戻り値：表示文字列のリスト
        //=========================================================================================
        public abstract string[] ToDisplayString();

        //=========================================================================================
        // 機　能：定義済み項目かどうかを返す
        // 引　数：なし
        // 戻り値：定義済み項目のときtrue
        //=========================================================================================
        public abstract bool IsDefined();

        //=========================================================================================
        // プロパティ：設定名
        //=========================================================================================
        public abstract string DisplayName {
            get;
            set;
        }

        //=========================================================================================
        // プロパティ：対象
        //=========================================================================================
        public abstract FileConditionTarget FileConditionTarget {
            get;
            set;
        }

        //=========================================================================================
        // プロパティ：ファイル名：条件
        //=========================================================================================
        public abstract FileNameType FileNameType {
            get;
            set;
        }

        //=========================================================================================
        // プロパティ：ファイル名：ファイル名（指定しないときnull）
        //=========================================================================================
        public abstract string FileName {
            get;
            set;
        }

        //=========================================================================================
        // プロパティ：更新日時の転送条件
        //=========================================================================================
        public abstract DateTimeCondition UpdateTimeCondition {
            get;
            set;
        }
    }
}
