using System;
using System.Collections.Generic;
using System.Text;
using ShellFiler.Api;
using ShellFiler.FileSystem;
using ShellFiler.FileSystem.Virtual;
using ShellFiler.Document;

namespace ShellFiler.FileTask.Provider {

    //=========================================================================================
    // インターフェース：バックグラウンドタスクに転送元ファイル情報を提供するインターフェース
    //=========================================================================================
    public interface IFileProviderSrc {

        //=========================================================================================
        // プロパティ：転送元ディレクトリのファイルシステム
        //=========================================================================================
        IFileSystem SrcFileSystem {
            get;
        }
        
        //=========================================================================================
        // プロパティ：ファイル一覧の情報
        //=========================================================================================
        IFileListContext FileListContext {
            get;
            set;
        }

        //=========================================================================================
        // プロパティ：転送元ファイルとディレクトリの数
        //=========================================================================================
        int SrcItemCount {
            get;
        }
        
        //=========================================================================================
        // 機　能：転送元のフルパスを返す
        // 引　数：[in]index    インデックス
        // 戻り値：転送元のファイル情報
        //=========================================================================================
        SimpleFileDirectoryPath GetSrcPath(int index);
    }
}
