using System;
using System.Collections.Generic;
using System.Text;
using ShellFiler.Api;
using ShellFiler.FileSystem;
using ShellFiler.FileSystem.Virtual;

namespace ShellFiler.FileTask.Provider {

    //=========================================================================================
    // インターフェース：バックグラウンドタスクに転送先ファイル情報を提供するインターフェース
    //=========================================================================================
    public interface IFileProviderDest {

        //=========================================================================================
        // プロパティ：転送先ディレクトリのファイルシステム
        //=========================================================================================
        IFileSystem DestFileSystem {
            get;
        }

        //=========================================================================================
        // プロパティ：ファイル一覧の情報
        //=========================================================================================
        IFileListContext FileListContext {
            get;
            set;
        }

        //=========================================================================================
        // プロパティ：転送先ディレクトリ名
        //=========================================================================================
        string DestDirectoryName {
            get;
        }
    }
}
