using System;
using System.Collections.Generic;
using System.Text;
using ShellFiler.Api;
using ShellFiler.FileSystem;
using ShellFiler.Document;

namespace ShellFiler.FileTask.Provider {

    //=========================================================================================
    // インターフェース：バックグラウンドタスクに転送先ファイル情報を提供するインターフェース
    //=========================================================================================
    public interface IFileProviderDestFiles {

        //=========================================================================================
        // プロパティ：転送先ファイルとディレクトリの数
        //=========================================================================================
        int DestItemCount {
            get;
        }
        
        //=========================================================================================
        // 機　能：転送先のファイル情報を返す
        // 引　数：[in]index    インデックス
        // 戻り値：転送元のファイル情報
        //=========================================================================================
        SimpleFileDirectoryPath GetDestPath(int index);

        //=========================================================================================
        // 機　能：転送元プロバイダに変換して返す
        // 引　数：なし
        // 戻り値：転送元プロバイダにへ関した形
        //=========================================================================================
        IFileProviderSrc GetSrcProvider();    
    }
}
