using System;
using System.Collections.Generic;
using System.IO;
using System.Windows.Forms;
using System.Threading;
using System.Security;
using ShellFiler.Api;
using ShellFiler.UI;
using ShellFiler.Command;
using ShellFiler.Util;

namespace ShellFiler.Document.Setting {

    //=========================================================================================
    // クラス：アーカイブ内の自動パスワード入力の設定1件分の情報
    //=========================================================================================
    public class ArchiveAutoPasswordItem {
        // 自動パスワードの表示名（仮想ディレクトリでの再利用で表示しないときは""）
        private string m_displayName;

        // パスワード
        private string m_password;
        
        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：[in]displayName  自動パスワードの表示名（仮想ディレクトリでの再利用で表示しないときは""）
        // 　　　　[in]password     パスワード
        // 戻り値：なし
        //=========================================================================================
        public ArchiveAutoPasswordItem(string displayName, string password) {
            m_displayName = displayName;
            m_password = password;
        }
        
        //=========================================================================================
        // 機　能：文字列化する（Comboboxで使用）
        // 引　数：なし
        // 戻り値：文字列化した結果
        //=========================================================================================
        public override string ToString() {
            return m_displayName;
        }

        //=========================================================================================
        // プロパティ：自動パスワードの表示名（仮想ディレクトリでの再利用で表示しないときは""）
        //=========================================================================================
        public string DisplayName {
            get {
                return m_displayName;
            }
            // setは禁止（Configurationでオプションとして保持しているため）
        }

        //=========================================================================================
        // プロパティ：パスワード
        //=========================================================================================
        public string Password {
            get {
                return m_password;
            }
            // setは禁止（Configurationでオプションとして保持しているため）
        }


        //=========================================================================================
        // クラス：手入力されたパスワード
        //=========================================================================================
        public class SpecifiedPassword : ArchiveAutoPasswordItem {

            //=========================================================================================
            // 機　能：コンストラクタ
            // 引　数：[in]directory  ディレクトリ
            // 　　　　[in]fileName   ファイル名
            // 戻り値：なし
            //=========================================================================================
            public SpecifiedPassword(string password) : base("", password) {
            }
        }
    }
}
