using System;

namespace ShellFiler.UI.Dialog.Option {

    //=========================================================================================
    // クラス：オプションダイアログの1ページ分の項目情報
    //=========================================================================================
    public class OptionStructureItem {
        // 階層の深さ（0:ルート）
        private int m_depth;

        // 項目のID
        private string m_id;

        // 項目名
        private string m_displayName;
        
        // ページのUIを実装するクラス
        private Type m_uiImplType;
        
        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：[in]depth        階層の深さ（0:ルート）
        // 　　　　[in]id           項目のID
        // 　　　　[in]displayName  項目名
        // 　　　　[in]uiImplType   ページのUIを実装するクラス
        // 戻り値：なし
        //=========================================================================================
        public OptionStructureItem(int depth, string id, string displayName, Type uiImplType) {
            m_depth = depth;
            m_id = id;
            m_displayName = displayName;
            m_uiImplType = uiImplType;
        }

        //=========================================================================================
        // プロパティ：階層の深さ（0:ルート）
        //=========================================================================================
        public int Depth {
            get {
                return m_depth;
            }
        }

        //=========================================================================================
        // プロパティ：項目のID
        //=========================================================================================
        public string Id {
            get {
                return m_id;
            }
        }

        //=========================================================================================
        // プロパティ：項目名
        //=========================================================================================
        public string DisplayName {
            get {
                return m_displayName;
            }
        }

        //=========================================================================================
        // プロパティ：ページのUIを実装するクラス
        //=========================================================================================
        public Type UIImplType {
            get {
                return m_uiImplType;
            }
        }
    }
}
