using System;
using System.Collections.Generic;
using System.Drawing;

namespace ShellFiler.Util {

    //=========================================================================================
    // クラス：内容変化のリスト
    //=========================================================================================
    public class ChangeLog<Type> {
        // リスト
        private List<Type> m_addList = new List<Type>();
        
        // 重複チェック用のSet
        private HashSet<Type> m_addSet = new HashSet<Type>();

        // リスト
        private List<Type> m_updateList = new List<Type>();
        
        // 重複チェック用のSet
        private HashSet<Type> m_updateSet = new HashSet<Type>();

        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：なし
        // 戻り値：なし
        //=========================================================================================
        public ChangeLog() {
        }

        //=========================================================================================
        // 機　能：追加項目を追加する
        // 引　数：[in]item   追加する項目
        // 戻り値：なし
        //=========================================================================================
        public void AddAddedItem(Type item) {
            if (!m_addSet.Contains(item)) {
                m_addSet.Add(item);
                m_addList.Add(item);
            }
        }

        //=========================================================================================
        // 機　能：更新項目を追加する
        // 引　数：[in]item   追加する項目
        // 戻り値：なし
        //=========================================================================================
        public void AddUpdatedItem(Type item) {
            if (!m_addSet.Contains(item) && !m_updateSet.Contains(item)) {
                m_updateSet.Add(item);
                m_updateList.Add(item);
            }
        }

        //=========================================================================================
        // プロパティ：追加項目のリスト
        //=========================================================================================
        public List<Type> AddedList {
            get {
                return m_addList;
            }
        }

        //=========================================================================================
        // プロパティ：更新項目のリスト
        //=========================================================================================
        public List<Type> UpdatedList {
            get {
                return m_updateList;
            }
        }
    }
}
