using System;
using System.Collections.Generic;
using System.Drawing;

namespace ShellFiler.Util {

    //=========================================================================================
    // クラス：内容に重複のないリスト
    //=========================================================================================
    public class UniqueList<Type> {
        // リスト
        public List<Type> m_list = new List<Type>();
        
        // 重複チェック用のSet
        public HashSet<Type> m_set = new HashSet<Type>();

        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：なし
        // 戻り値：なし
        //=========================================================================================
        public UniqueList() {
        }

        //=========================================================================================
        // 機　能：要素を追加する
        // 引　数：[in]element   追加する要素
        // 戻り値：なし
        //=========================================================================================
        public void Add(Type element) {
            if (!m_set.Contains(element)) {
                m_set.Add(element);
                m_list.Add(element);
            }
        }

        //=========================================================================================
        // プロパティ：格納項目のリスト
        //=========================================================================================
        public List<Type> List {
            get {
                return m_list;
            }
        }
    }
}
