using System;
using System.Collections.Generic;
using System.Text;
using ShellFiler.Api;

namespace ShellFiler.FileSystem.SFTP {

    //=========================================================================================
    // クラス：SFTPの内部処理を行うプロシージャ
    //=========================================================================================
    class SFTPProcedure {

        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：なし
        // 戻り値：なし
        //=========================================================================================
        public SFTPProcedure() {
        }
    }
}
