using System;
using System.Collections.Generic;
using System.Text;
using System.Web;

namespace ShellFiler.Api {

    //=========================================================================================
    // 構造体：バッファ中の位置を表す構造体
    //=========================================================================================
    public struct BufferRange {
        // オフセット位置のインデックス
        public int Offset;

        // 長さ
        public int Length;

        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：[in]offset   オフセット位置のインデックス
        // 　　　　[in]length   長さ
        // 戻り値：なし
        //=========================================================================================
        public BufferRange(int offset, int length) {
            Offset = offset;
            Length = length;
        }

        //=========================================================================================
        // プロパティ：長さ0の状態
        //=========================================================================================
        public static BufferRange Empty {
            get {
                return new BufferRange(0, 0);
            }
        }
    }
}
