using System;
using System.Collections.Generic;
using System.Text;

namespace ShellFiler.Api {

    //=========================================================================================
    // インターフェース：ファイルシステムごとのファイル一覧のコンテキスト情報
    //=========================================================================================
    public interface IFileListContext {

        //=========================================================================================
        // 機　能：タブの複製時にクローンを作成する
        // 引　数：なし
        // 戻り値：作成したクローン
        //=========================================================================================
        IFileListContext CloneForTabCopy();

        //=========================================================================================
        // 機　能：バックグラウンドタスク実行用にクローンを作成する
        // 引　数：なし
        // 戻り値：作成したクローン
        //=========================================================================================
        IFileListContext CloneForBackgroundTask();

        //=========================================================================================
        // 機　能：実行時のファイルを取得する
        // 引　数：[in]path  元のファイル
        // 戻り値：仮想フォルダ等を変換した後のファイル
        //=========================================================================================
        string GetExecuteLocalPath(string path);

        //=========================================================================================
        // 機　能：実行時のファイル一覧を取得する
        // 引　数：[in]pathList  元のファイル一覧
        // 戻り値：仮想フォルダ等を変換した後のファイル一覧
        //=========================================================================================
        List<string> GetExecuteLocalPathList(List<string> pathList);
    }
}
