using System;
using System.Collections.Generic;
using System.IO;
using System.Text;

namespace ShellFiler.Api {
    //=========================================================================================
    // 列挙子：UIでのコマンドが発生したことを通知するためのインターフェース
    //=========================================================================================
    public interface IUICommandTarget {

        //=========================================================================================
        // 機　能：UIでのコマンドが発生したことを通知する
        // 引　数：[in]sender  イベント発生原因の送信元の種別
        // 　　　　[in]item    発生したイベントの項目
        // 戻り値：なし
        //=========================================================================================
        void OnUICommand(UICommandSender sender, UICommandItem item);
    }
}
