using System;
using System.Collections.Generic;
using System.IO;
using System.Text;
using System.Windows.Forms;

namespace ShellFiler.Api {

    //=========================================================================================
    // クラス：キーボード入力された内容
    //=========================================================================================
    public class KeyCommand {
        // キーコード
        private Keys m_keyCode;
        
        // シフトキーが押されたときtrue
        private bool m_shift;
        
        // コントロールキーが押されたときtrue
        private bool m_control;

        // ALTキーが押されたときtrue
        private bool m_alt;

        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：[in]arg  KeyEventArgsの値
        // 戻り値：なし
        //=========================================================================================
        public KeyCommand(KeyEventArgs arg) {
            m_keyCode = arg.KeyCode;
            m_shift = arg.Shift;
            m_control = arg.Control;
            m_alt = arg.Alt;
        }

        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：[in]arg  PreviewKeyDownEventArgsの値
        // 戻り値：なし
        //=========================================================================================
        public KeyCommand(PreviewKeyDownEventArgs arg) {
            m_keyCode = arg.KeyCode;
            m_shift = arg.Shift;
            m_control = arg.Control;
            m_alt = arg.Alt;
        }

        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：[in]keyCode  キーコード
        // 　　　　[in]shift    シフトキーが押されたときtrue
        // 　　　　[in]conrol   コントロールキーが押されたときtrue
        // 　　　　[in]alt      ALTキーが押されたときtrue
        // 戻り値：なし
        //=========================================================================================
        public KeyCommand(Keys keyCode, bool shift, bool control, bool alt) {
            m_keyCode = keyCode;
            m_shift = shift;
            m_control = control;
            m_alt = alt;
        }

        //=========================================================================================
        // プロパティ：キーコード
        //=========================================================================================
        public Keys KeyCode {
            get {
                return m_keyCode;
            }
        }

        //=========================================================================================
        // プロパティ：シフトキーが押されたときtrue
        //=========================================================================================
        public bool Shift {
            get {
                return m_shift;
            }
        }

        //=========================================================================================
        // プロパティ：コントロールキーが押されたときtrue
        //=========================================================================================
        public bool Control {
            get {
                return m_control;
            }
        }

        //=========================================================================================
        // プロパティ：ALTキーが押されたときtrue
        //=========================================================================================
        public bool Alt {
            get {
                return m_alt;
            }
        }
    }
}
