
using System;
using System.Threading;

namespace ShellFiler.Api {

    //=========================================================================================
    // クラス：ファイル一覧のID（一覧そのもののID、左右/タブが変わるとIDが変わる）
    //=========================================================================================-
    public class UIFileListId : IdImpl {
        // 管理外のID
        public static readonly UIFileListId NullId = new UIFileListId(0);

        // 次に発行するID
        private static int s_nextId = 1;
        
        //=========================================================================================
        // 機　能：新しいIDを振り出す
        // 引　数：なし
        // 戻り値：タスクID
        //=========================================================================================
        public static UIFileListId NextId() {
            return new UIFileListId(Interlocked.Add(ref s_nextId, 1));
        }

        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：[in]taskId    設定するID
        // 戻り値：なし
        //=========================================================================================
        private UIFileListId(int id) : base(id) {
        }
    }
}
