using System;
using ShellFiler.Api;
using ShellFiler.Command;
using ShellFiler.MonitoringViewer;

namespace ShellFiler.Command.MonitoringViewer {
    
    //=========================================================================================
    // クラス：キー、ツールバーなどのイベントを受けて実行するテキストファイルビューア用のコマンド
    //=========================================================================================
    public abstract class MonitoringViewerActionCommand : ActionCommand {
        // モニタリングビューア
        private IMonitoringViewer m_monitoringViewer;
        
        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：なし
        // 戻り値：なし
        //=========================================================================================
        public MonitoringViewerActionCommand() {
        }

        //=========================================================================================
        // 機　能：パラメータをセットする
        // 引　数：[in]param  セットするパラメータ
        // 戻り値：なし
        //=========================================================================================
        public virtual void SetParameter(params object[] param) {
        }

        //=========================================================================================
        // 機　能：初期化する
        // 引　数：[in]viewer   モニタリングビューア
        // 戻り値：なし
        //=========================================================================================
        public void Initialize(IMonitoringViewer viewer) {
            m_monitoringViewer = viewer;
        }

        //=========================================================================================
        // 機　能：機能を実行する
        // 引　数：[in]param パラメータ
        // 戻り値：実行結果
        //=========================================================================================
        public abstract object Execute();

        //=========================================================================================
        // プロパティ：モニタリングビューア
        //=========================================================================================
        public IMonitoringViewer MonitoringViewer {
            get {
                return m_monitoringViewer;
            }
        }

        //=========================================================================================
        // プロパティ：コマンドのUI表現
        //=========================================================================================
        public abstract UIResource UIResource {
            get;
        }
    }
}
