using System;
using System.Collections.Generic;
using System.IO;
using System.Text;

using ShellFiler.Api;

namespace ShellFiler.Document {

    //=========================================================================================
    // クラス：ダミーのファイル一覧のコンテキスト情報
    //=========================================================================================
    class DummyFileListContext : IFileListContext {

        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：なし
        // 戻り値：なし
        //=========================================================================================
        public DummyFileListContext() {
        }

        //=========================================================================================
        // 機　能：タブの複製時にクローンを作成する
        // 引　数：なし
        // 戻り値：作成したクローン
        //=========================================================================================
        public IFileListContext CloneForTabCopy() {
            return new DummyFileListContext();
        }

        //=========================================================================================
        // 機　能：バックグラウンドタスク実行用にクローンを作成する
        // 引　数：なし
        // 戻り値：作成したクローン
        //=========================================================================================
        public IFileListContext CloneForBackgroundTask() {
            return new DummyFileListContext();
        }


        //=========================================================================================
        // 機　能：実行時のファイルを取得する
        // 引　数：[in]path  元のファイル
        // 戻り値：仮想フォルダ等を変換した後のファイル
        //=========================================================================================
        public string GetExecuteLocalPath(string path) {
            return path;
        }

        //=========================================================================================
        // 機　能：実行時のファイル一覧を取得する
        // 引　数：[in]pathList  元のファイル一覧
        // 戻り値：仮想フォルダ等を変換した後のファイル一覧
        //=========================================================================================
        public List<string> GetExecuteLocalPathList(List<string> pathList) {
            return pathList;
        }
    }
}
