using System;
using System.Collections.Generic;
using System.Text;
using ShellFiler.Api;
using ShellFiler.UI;
using ShellFiler.FileTask.DataObject;
using ShellFiler.FileTask.Condition;

namespace ShellFiler.Document {

    //=========================================================================================
    // クラス：ファイル1件分の情報と一覧中でのインデックス情報
    //=========================================================================================
    public class UIFileWithIndex {
        // ファイル情報
        private UIFile m_uiFile;

        // 一覧中でのインデックス
        private int m_index;

        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：[in]uiFile   ファイル情報
        // 　　　　[in]index    一覧中でのインデックス
        // 戻り値：なし
        //=========================================================================================
        public UIFileWithIndex(UIFile uiFile, int index) {
            m_uiFile = uiFile;
            m_index = index;
        }

        //=========================================================================================
        // プロパティ：ファイル情報
        //=========================================================================================
        public UIFile UIFile {
            get {
                return m_uiFile;
            }
        }

        //=========================================================================================
        // プロパティ：一覧中でのインデックス
        //=========================================================================================
        public int Index {
            get {
                return m_index;
            }
        }
    }
}
