using System;
using System.Collections.Generic;
using System.Text;
using ShellFiler.Api;

namespace ShellFiler.Document.SSH {

    //=========================================================================================
    // クラス：UI表示用のアカウント/サーバ単位でのコネクションプール
    // 　　　　バックグラウンド処理で非同期に更新された場合、UIに影響を受けないようにする考慮
    //=========================================================================================
    public class UIConnectionPoolInfo {
        // 接続先のユーザ名
        private string m_user;

        // 接続先のサーバ名
        private string m_server;

        // 接続先のポート番号
        private int m_portNo;

        // 使用中の接続数
        private int m_inUseCount;

        // このサーバとの接続で使用中のタスクIDのリスト
        private List<BackgroundTaskID> m_inUseTaskIdList;

        //=========================================================================================
        // 機　能：コンストラクタ
        // 引　数：[in]pool  対応するコネクションプール
        // 戻り値：なし
        //=========================================================================================
        public UIConnectionPoolInfo(ConnectionPool pool) {
            m_user = pool.User;
            m_server = pool.Server;
            m_portNo = pool.PortNo;
            m_inUseCount = pool.AllInUseCount;
            m_inUseTaskIdList = pool.InUseBackgroundTaskIdList;
        }

        //=========================================================================================
        // プロパティ：接続先のユーザ名
        //=========================================================================================
        public string User {
            get {
                return m_user;
            }
        }

        //=========================================================================================
        // プロパティ：接続先のサーバー名
        //=========================================================================================
        public string Server {
            get {
                return m_server;
            }
        }

        //=========================================================================================
        // プロパティ：接続先のポート番号
        //=========================================================================================
        public int PortNo {
            get {
                return m_portNo;
            }
        }

        //=========================================================================================
        // プロパティ：使用中の接続数
        //=========================================================================================
        public int AllInUseCount {
            get {
                return m_inUseCount;
            }
        }

        //=========================================================================================
        // プロパティ：このサーバとの接続で使用中のタスクIDのリスト
        //=========================================================================================
        public List<BackgroundTaskID> InUseTaskIdList {
            get {
                return m_inUseTaskIdList;
            }
        }
    }
}
